docs/ssh.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-30 Wed 00:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Getting started with SSH</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Katherine Chuang" />


<link rel="stylesheet" type="text/css" href="assets/style.min.css"/>

</head>
<body>
<div id="content">
<h1 class="title">Getting started with SSH
<br />
<span class="subtitle">Department of Computer &amp; Information Science, Brooklyn College</span>
</h1>



<div id="outline-container-orgfc89bde" class="outline-2">
<h2 id="orgfc89bde">Getting started with SSH</h2>
<div class="outline-text-2" id="text-orgfc89bde">
</div>


<div id="outline-container-org8500632" class="outline-4">
<h4 id="org8500632">What is SSH?</h4>
<div class="outline-text-4" id="text-org8500632">
<p>
SSH is an encrypted connection protocol that allows passing information between two machines. Generally you have a <i>client</i> that requests access and a <i>server</i> that responds to the requests.
</p>

<p>
Each SSH server has an identifying code (a host key).  If you connect to a server for the first time or if the server presets a different key then previously, you will have to go through the verification process again.
</p>
</div>
</div>

<div id="outline-container-orgaa3e097" class="outline-4">
<h4 id="orgaa3e097">What is an SSH Client?</h4>
<div class="outline-text-4" id="text-orgaa3e097">
<p>
An SSH client is a software which uses the SSH protocol to connect to a remote computer.
</p>

<p>
In general SSH protocol can be used for two purposes, file transfers and terminal access.
</p>
</div>
</div>

<div id="outline-container-org195b053" class="outline-4">
<h4 id="org195b053">When would you use SSH?</h4>
<div class="outline-text-4" id="text-org195b053">
<p>
You would use SSH when you want to connect to another machine, and with more a more secure protocol than telnet or rlogin protocols.
</p>
</div>
</div>
</div>

<div id="outline-container-orge6e17c4" class="outline-2">
<h2 id="orge6e17c4"><span class="section-number-2">1</span> SSH by terminal</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgdd34103" class="outline-4">
<h4 id="orgdd34103"><span class="section-number-4">1.0.1</span> How do I ssh in terminal?</h4>
<div class="outline-text-4" id="text-1-0-1">
<p>
There is a command line program called <a href="https://dashdash.io/1/ssh">ssh</a>
</p>
</div>
</div>

<div id="outline-container-org2db8748" class="outline-3">
<h3 id="org2db8748"><span class="section-number-3">1.1</span> SSH Program for Mac</h3>
<div class="outline-text-3" id="text-1-1">
<p>
This guide aims to provide possible options objectively, that is, without bias.
</p>
</div>

<div id="outline-container-org4d7d0d4" class="outline-4">
<h4 id="org4d7d0d4"><span class="section-number-4">1.1.1</span> What GUI programs are available to use on Mac</h4>
</div>
</div>



<div id="outline-container-org9802acd" class="outline-3">
<h3 id="org9802acd"><span class="section-number-3">1.2</span> SSH Programs for Windows</h3>
<div class="outline-text-3" id="text-1-2">
<p>
This guide aims to provide possible options objectively, that is, without bias.
</p>
</div>

<div id="outline-container-orgd484d64" class="outline-4">
<h4 id="orgd484d64"><span class="section-number-4">1.2.1</span> What GUI programs are available to use on Windows?</h4>
<div class="outline-text-4" id="text-1-2-1">
</div>
<ol class="org-ol">
<li><a id="orgd312a2c"></a>Putty<br />
<div class="outline-text-5" id="text-1-2-1-1">
<p>
PuTTY is an SSH and telnet client, developed originally by Simon Tatham for the Windows platform. PuTTY is open source software that is available with source code and is developed and supported by a group of volunteers.
<a href="https://www.putty.org/">https://www.putty.org/</a>
</p>
</div>
</li>

<li><a id="org269cbd5"></a>Solar Putty<br />
<div class="outline-text-5" id="text-1-2-1-2">
<p>
Solar Putty is a new SSH client that has a multi tab interface to support multiple sessions from one console. It has additional features beyond putty such as saved credentials, support for multiple sessions, quick access to the most recent sessions and integration of Windows search.
</p>

<p>
<a href="https://www.solarwinds.com/free-tools/solar-putty">https://www.solarwinds.com/free-tools/solar-putty</a>
</p>
</div>
</li>

<li><a id="org5e302df"></a>SSH Client<br /></li>
</ol>
</div>

<div id="outline-container-orgcd5a21e" class="outline-4">
<h4 id="orgcd5a21e"><span class="section-number-4">1.2.2</span> I heard you can use Linux on Windows, how do I do that?</h4>
<div class="outline-text-4" id="text-1-2-2">
</div>
<ol class="org-ol">
<li><a id="orgdfa841e"></a>Windows Subsystem for Linux<br />
<div class="outline-text-5" id="text-1-2-2-1">
<p>
<a href="https://docs.microsoft.com/en-us/windows/wsl/install-win10">https://docs.microsoft.com/en-us/windows/wsl/install-win10</a>
</p>
</div>
</li>

<li><a id="orgf4bafd4"></a>Windows Terminal<br />
<div class="outline-text-5" id="text-1-2-2-2">
<p>
<a href="https://www.microsoft.com/en-gb/p/windows-terminal/9n0dx20hk701?rtc=1&amp;activetab=pivot:overviewtab">https://www.microsoft.com/en-gb/p/windows-terminal/9n0dx20hk701?rtc=1&amp;activetab=pivot:overviewtab</a>
</p>
</div>
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org9322234" class="outline-2">
<h2 id="org9322234"><span class="section-number-2">2</span> What can I do with SSH?</h2>
<div class="outline-text-2" id="text-2">
<p>
You can log into other machines, such as the WEB Building&rsquo;s Linux server.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Katherine Chuang</p>
<p class="date">Created: 2020-09-30 Wed 00:46</p>
</div>
</body>
</html>
